---
type: PathReinSpanSymbol
namespace: Autodesk.Revit.DB.Structure
version: 2024
members: 2
tags: [revit-api, class]
---

# PathReinSpanSymbol

`Autodesk.Revit.DB.Structure.PathReinSpanSymbol` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Create | — | `public static PathReinSpanSymbol Create ( Document document , ElementId viewId , LinkElementId hostId , XYZ point , ElementId symbolId )` |
| Property | Parameter | — | `` |